# -*- coding: utf-8 -*-
from c000 import trans as base
import gen

base.update({
17: "话说这八句诗，是前朝宋朝神宗皇帝朝中一位很有名望的儒者所作。他姓邵，名尧夫，道号康节先生。这首诗是感叹五代乱世、残唐以来天下战火不停，那时候早上还归附梁朝，晚上就归附晋朝，正是人们所说的：“朱李石刘郭(11)，梁唐晋汉周，都来十五帝(12)，播乱五十秋(13)。”后来感动了天道循环(14)，在甲马营中生下了太祖武德皇帝(15)。这位圣人出世的时候，只见红光满天，奇异的香气整夜不散，原来他是上界霹雳大仙下凡投胎。他英雄勇猛，胸襟宽大，又有机谋，自古以来的帝王都比不上这位天子。“一条杆棒等身齐，打四百座军州都姓赵(16)！”这位天子扫平天下，安定中原(17)，定国号为大宋，建都汴梁(18)。他是九朝八帝的开头(19)，也是四百年帝业的开创者。因此，邵尧夫先生称赞道：“一旦云开复见天。”正像让百姓重新见到天日一样。",
19: "不只是这位先生吟诗称赞(20)，那时西岳华山有个陈抟处士(21)，是个道行高深、德行又好的人，能够辨别风云气色。一天，他骑着驴子下山，正在华阴道上走着，听见路上的旅客纷纷传说：“如今东京柴世宗把皇位让给赵检点，赵检点登基做天子了(22)。”那陈抟先生听了，心里欢喜，把手放在额头上，在驴背上哈哈大笑，笑得跌下驴来(23)。别人问他为什么这样高兴，先生说：“天下从此安定了。”这正合上天的意旨，下合地理，中合人心。从庚申年间接受禅让(24)，开创基业、登上帝位，在位十七年，天下太平，从此安定了下来。后来把皇位传给弟弟太宗即位。太宗皇帝在位二十二年，又传位给真宗皇帝。真宗又传位给仁宗。",
21: "这位皇帝，本是上界的赤脚大仙(25)。降生的时候，日夜啼哭不停。朝廷只好贴出黄榜(26)，召人来医治。这事感动了天庭，差遣太白金星下凡，变成一个白发老者，前来揭了黄榜，说自己能治太子的啼哭。看榜的官员把他领到殿下，朝见真宗天子。圣旨叫他进内苑去，看视太子。那老者一直走到宫中，抱着太子，在耳边低低说了八个字，太子就不啼哭了。那老者不说出姓名，只见化作一阵清风离去。他在耳边说的是哪八个字？说的是：“文有文曲(27)，武有武曲(28)。”果然是玉帝差遣紫微宫中两座星辰(29)，下凡来辅佐这位天子。文曲星是南衙开封府主、龙图阁大学士包拯(30)，武曲星是征西夏国大元帅狄青(31)。这两位贤臣，出来辅佐。",
23: "这位皇帝，庙号仁宗天子(32)，在位四十二年，改了九个年号(33)。从天圣元年癸亥登基(34)，到天圣九年，那时天下太平，五谷丰登(35)，百姓安居乐业，路上没人捡别人丢的东西，夜里家家不用关门，这九年叫做一登(36)。从明道元年到皇祐三年(37)，这九年也丰足，叫做二登。从皇祐四年到嘉祐二年(38)，这九年庄稼大熟，叫做三登。一连三个九年、共二十七年，号称三登之世，那时候百姓过了一段安欢乐的日子。谁想到乐到极处反倒生出悲来。嘉祐三年初春，天下瘟疫盛行，从江南直到两京(39)，没有一处百姓不染上这病。天下各州各府，像雪片一样纷纷把灾情上报朝廷(40)。",
})

gen.run('ch000', base)
