# -*- coding: utf-8 -*-
from c002 import trans as base
import gen

base.update({
31: "当时高俅辞别柳大郎，背上包裹，离开临淮州，慢慢取路回到东京(38)，径直来到金梁桥下董生药家(39)，送上这封书信。董将士一见高俅，又把柳世权的来信从头到尾看了一遍，心里暗暗寻思道：“这高俅，我家怎么容得下他！如果他是个诚实老实的人，可以容他在家里出入，也教孩子们跟着学些好。他却是个帮闲的破落户、没品行的人(40)，况且当初犯过事，是被开封府判罪赶出境外的人。要是留他在家中，反倒引得孩子们不学好；可要不收留他，又碍不过柳大郎的情面(41)，一时实在拿不定主意。”当时只好暂且欢天喜地，相留他在家宿歇，每日好酒好肉管待，不敢怠慢。住了十几天，董将士思前想后，才想出一个由头，拿出一套衣服，写了一封书信，对高俅说道：“小人家这点萤火之光(42)，照不亮人，怕日后误了足下。我把足下转荐到小苏学士那里(43)，日后也好得个出身(44)。足下意下如何？”高俅大喜，谢过董将士。董将士便派个人拿着书信，领着高俅径直来到学士府里。",
61: "且说高俅做了殿帅府太尉，挑了个吉日良辰，前去殿帅府上任职。所有应属的公吏衙将、都军禁军、马步人等(92)，都来参拜，各自呈上手本(93)，报上名册(94)。高殿帅一一点过(95)，里面单单只少了一名八十万禁军教头王进(96)，半个月之前已有病假文书报在官府，病还没好，不曾进衙门办事。高殿帅大怒，喝道：“胡说！既然有手本呈来，莫不是那家伙抗拒官府(97)、搪塞本官(98)。这人一定是装病在家，快给我拿来！”随即派人到王进家来，捉拿王进。",
125: "自从史太公死后，又早过了三四个月。时当六月中旬，天正炎热。那一天，史进没什么消遣，搬了把交床(222)，坐在打麦场边柳树荫下乘凉。对面松林里透进风来，史进不觉喝彩道：“好凉风！”正乘着凉，忽见一个人探头探脑地在那里张望。史进喝道：“奇怪(223)！谁在那里张望俺庄上(224)？”史进跳起身来，转过树背后，仔细一看，认得是猎户摽兔李吉(225)。史进喝道：“李吉！张望我庄里做什么？莫不是来踩点(226)？”李吉上前行礼道(227)：“大郎，小人想到庄上找矮丘乙郎喝碗酒，因为见大郎在这里乘凉，不敢过来冒犯。”史进道：“我问你，往常你总是担些野味来我庄上卖，我又不曾亏待你，为什么一直不拿来卖给我(228)？莫不是欺负我没钱？”李吉答道：“小人怎么敢！一直没打到野味，所以不敢来。”史进道：“胡说！偌大一个少华山，那样广阔，不信连个獐子兔子都没有。”李吉道：“大郎原来不知道。如今近来山上添了一伙强人(229)，扎下一座山寨(230)，在上面聚集了五六百个小喽啰(231)，有百十匹好马。为首的那个大王叫神机军师朱武，第二个叫跳涧虎陈达，第三个叫白花蛇杨春。这三个人为首，打家劫舍(232)。华阴县里不敢捉他们，出了三千贯赏钱召人拿他们。谁敢上去惹他们？因此小人们不敢上山打猎，哪里弄来卖！”史进道：“我也听说是有一伙强人，想不到这些家伙这样大干(233)，必定要扰害人。李吉，你今后有野味时，找些来。”李吉唱了个喏，自己走了。",
131: "且说少华山寨里，三个头领坐定商议。为首的神机军师朱武(239)，虽然本身没什么本领，却很有谋略。朱武对陈达、杨春说道：“如今我听说华阴县里出了三千贯赏钱，召人捉我们。只怕官兵来时(240)，要跟他们厮杀一场。只是山寨钱粮缺少，何不去劫掠些来，供山寨使用，再多积攒些粮食在寨里，防备官军来时，好跟他们周旋。”跳涧虎陈达道：“说得是。如今就去华阴县里先向他们借粮，看他们怎么样。”白花蛇杨春道：“不要去华阴县，只去蒲城县，万无一失。”陈达道：“蒲城县人户稀少，钱粮不多。不如只打华阴县，那里人口富足，钱粮充足。”杨春道：“哥哥不知道，要是去打华阴县，必定要从史家村经过。那个九纹龙史进是只猛虎(241)，不要去招惹他(242)。他怎么肯放我们过去？”陈达道：“兄弟太懦弱了！一个村坊都过不去，怎么敢抵挡官军？”杨春道：“哥哥不要小看他，那人确实厉害(243)。”朱武道：“我也听说他十分英雄，说这人真有本事。兄弟还是不要去！”陈达叫起来，说道：“你们两个闭上鸟嘴(244)！长别人志气，灭自己威风。他也只是一个人，又不是三头六臂，我不信。”喝叫小喽啰：“快备我的马来！如今就去先打史家庄，后取华阴县。”朱武、杨春再三劝阻。",
143: "陈达在马上看着史进，欠身行礼。史进喝道：“你们杀人放火、打家劫舍，犯下弥天大罪(258)，都是该死的人。你也该有耳朵，好大的胆子，竟敢到太岁头上动土(259)！”陈达在马上答道：“俺山寨缺少些粮食，想往华阴县借粮，经过贵庄，借一条路(260)，绝不敢动你一根草。请放我们过去，回来定当拜谢。”史进道：“胡说！我家现当着里正，正要来拿你们这伙贼。今天你来了，从我村里经过，我要是不拿你、反放你过去，本县知道了，必定连累我。”陈达道：“四海之内(261)，都是兄弟。麻烦借一条路。”史进道：“什么废话！我肯时，有一个不肯。你问得他肯了，就去。”陈达道：“好汉叫我问谁？”史进道：“你问得我手里这口刀肯了，就放你去。”陈达大怒道：“赶人不要赶尽(262)，不要逞能！”史进也怒了，抡手中刀，催坐下马(263)，来战陈达。陈达也拍马挺枪来迎史进。两个交战，只见：",
153: "史进上了马，正要出庄门，只见朱武、杨春步行已经到了庄前，两个双双跪下，眼里含着泪。史进下马来喝道：“你两个跪着有什么话说？”朱武哭道：“小人等三个，屡次被官府逼迫(279)，不得已上山落草(280)。当初发愿说：‘不求同日生，只愿同日死。’虽然比不上关、张、刘备的义气(281)，这份心却是一样的。今天小弟陈达不听好话，误犯虎威，已被英雄擒捉在贵庄。没法恳求，如今前来领死(282)。望英雄把我们三人一并解送官府请赏，我们誓不皱眉。我等就在英雄手里领死，毫无怨心。”史进听了，寻思道：“他们竟这样讲义气(283)！我要是拿他们去解送官府请赏，反倒让天下好汉耻笑我不英雄。自古说：大虫不吃伏肉(284)。”史进便道：“你两个暂且跟我进来。”朱武、杨春毫无惧色，跟着史进直到后厅前跪下，又请史进把他们绑起来。",
175: "原来摽兔李吉正在那山坡下张网捉兔，认得是史家庄上的王四，就赶进林子里来扶他，哪里扶得动。只见王四搭膊里露出银子来，李吉寻思道：“这家伙醉了。哪里弄来这么多银子！何不拿他一些？”也是天罡星该当聚会，自然生出机会来。李吉解开那搭膊，往地上只一抖，那封回信和银子都抖了出来。李吉捡起来，颇认得几个字，把信拆开一看，见上面写着少华山朱武、陈达、杨春，中间大多是些文白夹杂的话，认不得，只认得三个名字。李吉道：“我做猎户，什么时候能发达。算命的道我今年有大财，原来在这里！华阴县里正出三千贯赏钱，捉拿他三个贼人。可恨史进那家伙，前日我去他庄上找矮丘乙郎，他说我是来踩点探路。你原来倒和贼人来往！”银子和信都拿了去，往华阴县里出首。",
189: "史进正和三个头领在后园饮酒，赏玩中秋，叙说旧话新言。只听墙外一声喊起，火把乱晃。史进大惊，跳起身来，吩咐：“三位贤友暂且坐着，等我去看看。”喝叫庄客不要开门。搬条梯子(315)，上墙一看，只见是华阴县县尉骑在马上，带着两个都头(316)，领了三四百土兵(317)，围住了庄院。史进和三个头领只顾叫苦。外面火把光中，照见钢叉、朴刀、五股叉、留客住(318)，摆得像麻林一般。两个都头口里叫道：“不要走了强贼！”",
})

gen.run('ch002', base)
