# -*- coding: utf-8 -*-
from c006 import trans as base
import gen

base.update({
13: "话说鲁智深走过几个山坡，见一座大松林、一条山路。他顺着那山路走去，走了不到半里，抬头看时，却见一所败落的寺院，被风吹得铃铎作响。看那山门时，上面有一面旧朱红牌额，上面有四个金字，都模糊了(2)，写着“瓦罐之寺”。又走了不到四五十步，过了一座石桥，再看时，是一座古寺，已有好些年头。进了山门里，仔细看来，虽然是大寺，却破损得厉害(3)。只见：",
19: "找到厨房后面一间小屋，见几个老和尚坐着，一个个面黄肌瘦。智深喝一声道：“你们这些和尚好没道理！任由洒家叫唤，却一个也不答应。”那和尚摇手道：“不要高声。”智深道：“俺是过路的僧人，讨顿饭吃(14)，有什么干系？”老和尚道：“我们三天没一粒饭下肚了，哪里讨饭给你吃！”智深道：“俺是五台山来的僧人，粥也随便请洒家吃半碗。”老和尚道：“你是活佛圣地来的僧人，我们理当供你斋饭(15)。怎奈我寺里僧众走散了(16)，并没有一粒斋粮。老僧等确实饿了三天。”智深道：“胡说！这样大的地方(17)，不信没斋粮。”老和尚道：“我这里是个不寻常的地方(18)。只因是十方常住(19)，被一个云游和尚带着一个道人来此住持(20)，把常住的财物无论好坏都毁坏了。他们两个无所不为，把众僧都赶出去了。我们几个老的走不动，只好在这里过活。因此没饭吃。”智深道：“胡说！就算他一个和尚、一个道人(21)，能做得什么事，怎么不去官府告他？”老和尚道：“师父你不知道，这里衙门又远，就算是官军也管不了他们。这和尚、道人好生厉害，都是杀人放火的人，如今在方丈后面一个去处安身。”智深道：“这两个叫什么？”老和尚道：“那和尚姓崔，法号道成，绰号生铁佛(22)。道人姓丘，排行小乙(23)，绰号飞天夜叉(24)。这两个哪里像出家人，只是绿林中的强贼一般(25)，借出家来遮掩身份(26)。”",
21: "智深正问着，猛闻到一阵香气。智深提着禅杖，转到后面(27)。打眼一看，见一个土灶，盖着一个草盖，热气腾腾地冒起来。智深揭起一看，煮着一锅粟米粥。智深骂道：“你们这几个老和尚没道理！只说三天没饭吃，如今却煮着一锅粥。出家人为什么说谎？”那几个老和尚见智深寻出粥来，只顾叫苦，把碗、碟、钵头、杓子、水桶(28)，都抢了过去。智深肚子饿，没办法，见了粥想吃，又找不到盛的地方，只见灶边有个破漆长桌，上面只有些灰尘。",
35: "智深走到面前，那和尚吃了一惊，跳起身来，便道：“请师兄坐，一同喝一杯。”智深提着禅杖道：“你们两个为什么把寺院废了？”那和尚便道：“师兄请坐，听小僧说。”智深瞪着眼道：“你说，你说！”那和尚道：“从前敝寺是个极好的去处，田庄又广，僧众极多，只因被廊下那几个老和尚喝酒撒泼(35)、拿钱养女人，长老管束不住他们，他们又把长老告发排挤了出去(36)。因此把寺院都废了，僧众全都走散，田土也都卖了。小僧和这个道人新来此间住持，正要整理山门、修盖殿宇。”智深道：“这妇人是谁？为什么在这里喝酒。”那和尚道：“师兄容禀：这个娘子，是前村王有金的女儿。从前她父亲是本寺的檀越，如今年家道消乏(37)，近来十分狼狈，家里人口都没了，丈夫又患病，因此来敝寺借米。小僧看施主檀越的面子，拿酒招待，别无他意，只是敬重。师兄不要听那几个老畜生的话。”智深听了他这一番话，又见他这样小心，便道：“可恨几个老僧戏弄洒家！”提着禅杖，再回香积厨来。",
55: "那汉子在树林里听了，大笑道：“我晦气，他倒来惹我！”就从树林里拿着朴刀，翻转身跳出来，喝一声：“秃驴！你自己找死，不是我来寻你。”智深道：“叫你认得洒家！”抡起禅杖扑向那汉子。那汉子捻着朴刀，来斗和尚。正要上前，肚里寻思道：“这和尚声音好熟。”便道：“那和尚，你的声音好熟。你姓什么？”智深道：“俺且跟你斗三百合，再说姓名。”那汉子大怒，拿着手中朴刀来迎禅杖。两个斗了十几合，那汉子暗暗喝彩道：“好个莽和尚！”又斗了四五合，那汉子叫道：“歇一歇，我有话说。”两个都跳出圈子外来。那汉子便问道：“你到底姓甚名谁？声音好熟。”智深说完姓名，那汉子丢下朴刀，翻身就剪拂，说道：“认得史进吗？”智深笑道：“原来是史大郎。”两个再次剪拂，一同到树林里坐定。",
61: "到了寺前，看见那崔道成、丘小乙两个，还兀自在桥上坐着。智深大喝一声道：“你们这些家伙，来，来！这回跟你斗个你死我活！”那和尚笑道：“你是我手下的败将，怎么还敢来并斗？”智深大怒，抡起铁禅杖，奔过桥来。那生铁佛发起怒来(53)，拿着朴刀，杀下桥去。智深一来有了史进，肚里胆壮，二来吃饱了饭，那精神气力越发使出来。两个斗到八九合，崔道成渐渐力怯，只想着逃跑(54)。那飞天夜叉丘道人见和尚输了，便拿着朴刀来相助。这边史进见了，便从树林里跳出来，大喝一声：“都不要走！”掀起斗笠，挺着朴刀，来战丘小乙。四个人两对厮杀，斗得像画阁上的一样。只见：",
65: "智深和崔道成正斗到激烈处(57)，智深得了个空当，喝一声：“着！”只一禅杖，把生铁佛打下桥去。那道人见和尚倒了，无心恋战，卖个破绽就走。史进喝道：“哪里去！”赶上照他后心一朴刀，扑地一声响，道人倒在一旁。史进踏上前去，调转朴刀，朝下面只顾肐肢肐察地搠(58)。智深赶下桥去，朝崔道成后身一禅杖。可怜两个强徒，化作南柯一梦(59)。正是：从前作过事，无幸一齐来(60)。",
101: "清长老唤集两班许多职事僧人，都到方丈，说道：“你们众僧在这里。你看我师兄智真禅师好不分晓事理(116)！这个来的僧人，原本是经略府军官，因为打死了人，落发为僧，两次在他那里闹了僧堂，因此难安置他。你那里容不下他，却推给我。要是不收留他，师兄这样万千叮嘱，不可推辞；要是留他在这里，倘若乱了清规，又怎么办！”",
107: "首座又道：“你听我跟你说。僧门中职事人员，各有名目(124)。比如小僧，做个知客，只管接待往来的客官僧众。像维那、侍者、书记、首座，这都是清闲的职位(125)，不容易做到。都寺、监寺、提点、院主(126)，这些是掌管常住财物的。你刚来方丈，怎么就能得着上等职事？还有那管藏的叫做藏主(127)，管殿的叫做殿主(128)，管阁的叫做阁主(129)，管化缘的叫做化主(130)，管浴堂的叫做浴主(131)，这些都是主事人员(132)，属于中等职事。还有那管塔的塔头，管饭的饭头，管茶的茶头，管菜园的菜头，管东厕所的净头(133)，这些都是头事人员(134)，属于末等职事。比如师兄你管了一年菜园，管得好，就升你做个塔头。又管了一年，管得好，升你做浴主。再管一年，管得好，才做监寺。”智深道：“既然这样，也有个出头之日，洒家明天就去。”",
117: "那几个泼皮看了，便去跟众破落户商议道：“大相国寺派一个和尚，什么鲁智深来管菜园。我们趁他新来，闹一场(138)，一顿打他个下马威，叫那家伙服我们。”其中一个道(139)：“我有个主意。他又不曾认得我，我们怎么就去寻他的闹？等他来时，骗他到粪窖边，装作恭贺他，双手抢住他的脚，翻个筋斗把那家伙弄下粪窖去(140)，只是小小耍弄他一下。”众泼皮道：“好，好！”商量定了，单等看他来。",
17: "鲁智深进了寺来，便投知客寮去(10)。只见知客寮门前大门也没了，四周围的墙壁篱笆全无(11)。智深寻思道：“这样大的寺院，怎么败落成这样？”",
23: "智深见了，人急生智，便把禅杖靠好，就灶边抓把草，把长桌上的灰尘擦抹干净，双手把锅端起来(29)，把粥往长桌上一倒。",
43: "那个生铁佛崔道成，手中捻着朴刀，跟智深并斗。两个一来一往，一去一回，斗了十四五合。那崔道成斗不过智深，只有架隔遮拦、举杖躲闪(43)，抵挡不住，正要逃走。",
67: "智深、史进把丘小乙、崔道成两具尸首，都绑了扔进山涧里。两个再打进寺里来。香积厨下那几个老和尚，因为见智深输了走了，怕崔道成、丘小乙来杀他们，已经都上吊死了。",
69: "智深道：“既然有了包裹，依原样背上。”再寻到里面，只见床上三四条包衣服。史进打开，都是衣裳，里面包着些金银，拣好的包了一包袱，背在身上。",
73: "智深和史进看着，等了一会儿，四下里火都烧着了。二人道：“梁园虽好(69)，不是久恋之家。俺二人只好走开。”",
79: "智深、史进来到村中酒店里，一面喝酒，一面叫酒保买些肉来，借些米来，做饭吃。两个喝着酒，诉说路上许多事情。",
91: "智深进了寺来。东西廊下看了看，径投知客寮去(97)。道人撞见，报与知客。不多时，知客僧出来，见智深生得凶猛，提着铁禅杖，挎着戒刀，背着个大包裹，先有五分的怕他。",
})

gen.run('ch006', base)
