# -*- coding: utf-8 -*-
from c007 import trans as base
import gen

base.update({
13: "话说那酸枣门外二三十个泼皮破落户中间，有两个领头的，一个叫做过街老鼠张三，一个叫做青草蛇李四。这两个领头的假装前来迎接，智深也正好走到粪窖边，看见这伙人都不动，只站在窖边，齐道：“俺们特地来给和尚道贺。”智深道：“你们既然是邻舍街坊，都来廨宇里坐。”张三、李四便拜倒在地，不肯起来，只指望和尚来扶他，便要趁机动手。智深见了，心里早已犯疑道：“这伙人不三不四(3)，又不肯近前来，莫不是要算计洒家？那家伙倒是反过来捋虎须，俺且走上前去，叫那家伙看看洒家的手段。”",
19: "智深叫道：“都来廨宇里坐着说话。”智深先居中坐了，指着众人道：“你们这伙鸟人，不要瞒洒家。你们都是些什么鸟人，来这里戏弄洒家？”那张三、李四和众伙伴一齐跪下(5)，说道：“小人祖居在这里，都只靠赌博讨钱为生。这片菜园是我们的衣饭碗(6)，大相国寺几次使钱要收拾我们都没得逞。师父是哪来的长老？这样了得！相国寺里从没见过有师父这样的人物。今天我们情愿服侍您！”智深道：“洒家是关西延安府老种经略相公帐前的提辖官，只因杀的人多，因此情愿出家，从五台山来到这里。洒家俗姓鲁，法名智深。别说你们这二三十个人算什么，就是千军万马队里，俺也敢直杀进去再杀出来！”众泼皮连声应诺(7)，拜谢了散去。智深自己回廨宇房里，收拾整顿歇卧。",
25: "智深端详了一下(15)，走到树前，把直裰脱了(16)，身子朝下倒扭过来(17)，右手向下，又用左手扳住树的上半截，把腰只一挺，将那株绿杨树连根拔起。众泼皮见了，一齐拜倒在地，只叫：“师父不是凡人，正是真罗汉！身上没有千万斤的气力，怎么拔得起来！”智深道：“有什么鸟要紧！明天都来看洒家演武使兵器。”众泼皮当晚各自散去。从第二天起，这二三十个破落户对智深服服帖帖(18)，每天拿酒肉来请智深，看他演武打拳(19)。",
35: "那林教头便跳进墙来。两个就在槐树下相见，一同坐下。林教头便问道：“师兄是哪里人？法名叫什么？”智深道：“洒家就是关西鲁达。只因杀的人多，情愿做僧人。年幼时也曾到过东京，认得令尊林提辖(28)。”林冲大喜，当即与智深结义，尊他为兄(29)。智深道：“教头今天为什么到这里？”林冲答道：“刚才和内人一同来隔壁岳庙里还香愿(30)。林冲听见舞棒，看得入眼，叫女使锦儿陪内人去庙里烧香，林冲就在这里等候，不想遇见师兄。”智深道：“洒家刚到这里，正没有相识，得这几位大哥每天相伴。如今又承蒙教头不嫌弃，结为弟兄，实在好得很。”便叫道人再添酒来款待。",
39: "林冲辞别智深，急忙跳过墙缺(33)，和锦儿径直奔岳庙里来。抢到五岳楼看时，见了几个人拿着弹弓、吹筒、粘竿，都站在栏杆边(34)。楼梯上一个年轻后生(35)，独自背立着，把林冲的娘子拦住道：“你且上楼去，跟你说话。”林冲娘子红着脸道：“清平世界，什么道理，调戏良家妇女！”林冲赶到跟前，把那后生肩胛只一扳过来(36)，喝道：“调戏良家妻子，该当何罪！”正要下拳打时，认得是本管高太尉的螟蛉之子高衙内(37)。原来高俅刚发迹，没有亲生儿子，无人帮助，因此过继了叔叔高三郎的儿子在房里做养子(38)。原本是叔伯弟兄，却给他做干儿子，因此高太尉十分爱惜他。那家伙在东京倚仗权势横行霸道，专爱奸污人家的妻女。京城人惧怕他的权势，谁敢跟他争吵(39)，都叫他花花太岁(40)。",
55: "且说林冲连日闷闷不乐，懒得上街。巳牌时分(60)，听门口有人叫道：“教头在家吗？”林冲出来看时，却是陆虞候，慌忙道：“陆兄怎么来了？”陆谦道：“特地来探望，兄长怎么连着几天在街上不见人影？”林冲道：“心里闷，不曾出去。”陆谦道：“我陪兄长去喝三杯解闷。”林冲道：“稍坐，请喝茶。”两个喝了茶起身。陆虞候道：“阿嫂，我陪兄长到我家去喝三杯。”林冲娘子赶到布帘下，叫道：“大哥(61)，少喝早回。”",
59: "林冲喝了八九杯酒，因要小解(63)，起身道：“我去净手就来。”林冲下了楼，出酒店门，往东小巷里去净了手。转身出巷口，只见女使锦儿叫道：“官人，找得我好苦，原来在这里！”林冲慌忙问道：“做什么？”锦儿道：“官人和陆虞候出来，不到半个时辰，只见一个汉子慌慌张张奔到家里，对娘子说：‘我是陆虞候家的邻居。你家教头和陆谦喝酒，教头一口气没上来，就昏倒了，叫娘子快去看看。’娘子听了，连忙托隔壁王婆看家，和我跟那汉子去，直到太尉府前小巷里的一户人家。上了楼，只见桌子上摆着些酒食，不见官人。正要下楼，只见前几天在岳庙里骚扰娘子的那个后生出来道：‘娘子稍坐，你丈夫来了。’锦儿慌张跑下楼时，只听娘子在楼上叫‘杀人’。因此我到处找官人找不到(64)，正好撞见卖药的张先生，他说：‘我在樊楼前经过，见教头和一个人进去喝酒。’因此特地奔到这里。官人快去！”",
73: "老都管到晚上来见太尉，说道：“衙内不是害别的病，是害上了林冲的老婆。”高俅道：“什么时候见了他的浑家(79)？”都管禀道：“就是上月二十八日，在岳庙里见的，如今已有一个多月了。”又把陆虞候设的计策细说了一遍。高俅道：“这样的话，因为他浑家怎么去害他？我寻思起来，要是为了顾惜林冲一个人，就得送我孩儿的性命，这可怎么办好？”都管道：“陆虞候和富安有主意(80)。”高俅道：“既然这样，叫他们二人来商议。”老都管随即唤陆谦、富安进来，一同入到堂里，唱了喏。高俅问道：“我这小衙内的事，你两个有什么主意？救得我孩儿好了，我自会提拔你二人(81)。”陆虞候上前禀道：“恩相在上，除非如此如此才行(82)。”高俅听了，喝彩道：“好计！你两个明天就给我去办。”这也不在话下。",
85: "第二天，巳牌时分，只听门口有两个承局叫道(91)：“林教头，太尉钧旨，说你买了一口好刀，就叫你带去比看。太尉在府里专等！”林冲听了，说道：“又是什么多嘴的报上去了(92)。”两个承局催着林冲穿了衣服，拿了那口刀，跟着这两个承局来。一路上，林冲道：“我在府里不认得你。”两个人说道：“小人最近才来跟着当差(93)。”早来到府前，进到厅前，林冲站住了脚。两个又道：“太尉在里面后堂坐着。”转过屏风，到后堂，又不见太尉，林冲又站住脚。两个又道：“太尉就在里面等你，叫引教头进去。”又过了两三重门，到一个地方，四周围都是绿栏杆。两个又引林冲到堂前，说道：“教头，你只在这里稍待，等我们进去禀告太尉。”",
89: "林冲看时，不是别人，正是本管高太尉。林冲见了，拿着刀上前唱喏。太尉喝道：“林冲，又没人叫你，你怎么敢擅自进入白虎节堂！你懂不懂法度？你手里拿着刀，莫不是来刺杀本官？有人对我说，你两三天前拿着刀在府前守候，必有歹心(95)！”林冲躬身禀道：“恩相，刚才承蒙两个承局叫林冲，带刀来比看。”太尉喝道：“承局在哪里？”林冲道：“恩相，他们两个已经到堂里去了。”太尉道：“胡说！什么承局敢进我府堂里去？左右，给我拿下这家伙！”",
})

gen.run('ch007', base)
