# -*- coding: utf-8 -*-
from c008 import trans as base
import gen

base.update({
13: "话说当时太尉喝叫左右排开军校，拿下林冲就要斩，林冲大叫冤屈。太尉道：“你到节堂来有什么事？如今手里拿着利刃，怎么不是来杀本官？”林冲禀告道：“太尉不叫我，我怎么敢来见！有两个承局到堂里去了，故意骗林冲到这里。”太尉喝道：“胡说！我府里哪有承局？这家伙不服判决(1)！”喝叫左右：“押去开封府，吩咐滕府尹好好审问，查问明白再处决。把宝刀封了带去。”",
21: "府尹道：“林冲，你是个禁军教头，怎么不知法度，手拿利刃，故意进入节堂？这是该死的罪犯！”林冲禀告道：“恩相明镜高悬，念林冲负屈含冤。小人虽然是粗鲁的军汉，却也颇懂些法度，怎么敢擅自进入节堂？只因上月二十八日，林冲和妻子到岳庙还香愿，正好撞见高太尉的小衙内调戏妻子，被小人喝散。后来，他们又让陆虞候骗小去吃酒，却让富安来骗林冲妻子到陆虞候家楼上调戏，也被小人赶去，把陆虞候家打了一场。两次虽然都没有成奸，都有人证。第二天，林冲自己买了这口刀。今天，太尉派两个承局来家里叫林冲，叫带刀来府里比看，因此林冲跟两人到节堂下。两个承局进堂里去了，没想到太尉从外面进来，设计陷害林冲。望恩相给小人做主！”",
25: "正好有个当案孔目(19)，姓孙名定，为人最是耿直，十分好善，只想成全照顾人(20)，因此人们都叫他孙佛儿(21)。他明知这件事的内情，就在府里婉转曲折地说明底细(22)，禀道：“这件事确实是冤屈了林冲，只可成全他。”府尹道：“他犯下这样的罪，高太尉批示定罪，一定要审他‘手拿利刃，故意进入节堂，杀害本官’(23)，怎么成全他？”孙定道：“这南衙开封府不是朝廷的，难道是那高太尉家的？”府尹道：“胡说！”孙定道：“谁不知道高太尉当权，倚仗势力横行霸道，加上他府里无恶不作，只要有人小小触犯，就发来开封府，要杀就杀，要剐就剐，这难道不是他家的官府？”",
31: "只见众邻居和林冲的岳父张教头，都在府前接着，同林冲和两个公人，到州桥下酒店里坐定。林冲道：“多亏孙孔目维持，这棒打得不算狠毒(32)，因此还能动弹。”张教头叫酒保安排下酒菜果子，款待两个公人。酒过几杯，只见张教头拿出银两，打发两个防送公人。林冲执手对岳父说道：“泰山在上(33)。时运不济(34)，撞上了高衙内，吃了一场冤枉官司(35)。今天有句话，要禀告泰山：自从承蒙泰山错爱，把令爱嫁给我(36)，已经三年，不曾有半点儿差错(37)。虽然不曾生下一儿半女，也未曾红过脸(38)、半点相争。如今小人遭这场横祸，发配沧州，生死存亡未保。娘子在家，小人心去不稳，实在怕高衙内威逼这门亲事。况且她青春年少，不要为林冲误了前程。这是林冲自己的主张，不是别人逼迫，小人今天就当着高邻的面，明明白白立一纸休书(39)，任凭改嫁，并无争执。这样，林冲走得心安，免得高衙内陷害！”",
33: "张教头道：“林冲，这是什么话！你是流年不利(40)，遭了横祸(41)，又不是你自己招惹出来的。今天暂且去沧州躲灾避难，早晚老天可怜，放你回来时，依旧夫妻团聚。老汉家中也有些家业(42)，明天就把我女儿接回家去(43)，连同锦儿，不管怎样(44)，三年五载，我养活她。又不让她出门，高衙内就是想见也见不着。你不要忧心，都在老汉身上。你在沧州牢城，我自会常常寄书信和衣服给你。不要胡思乱想，只管放心去！”",
41: "正在阁子里写着，要交给泰山收着时，只见林冲的娘子号天哭地地叫将来。女使锦儿抱着一包衣服，一路找到酒店里。林冲见了，起身接着道：“娘子，小人有句话，已经禀告过泰山了。只因林冲时运不好，遭这场冤屈事。如今去沧州，生死不保，实在怕误了娘子的青春，现在已经写下几个字在这里。万望娘子不要等小人，有好人家(51)，自己另行嫁人，不要为林冲误了贤妻。”那妇人听了，哭将起来，说道：“丈夫！我不曾有半点儿玷污，怎么就把我休了？”林冲道：“娘子，我是好意，怕日后两相耽误，害了你。”张教头便道：“我儿放心，虽然林冲这样主张，我难道忍心把你再嫁人(52)。这事且由他放心去。他就是不回来，我也为你安排好一世的生活费用(53)，只叫你守节就是了。”",
55: "酒过几杯，那人从袖子里取出十两金子，放在桌上，说道：“二位端公各收五两，有件小事相烦。”二人道：“小人素来不认得尊官，为什么给我们金子？”那人道：“二位莫不是往沧州去？”董超道：“小人两个奉本府差遣，押解林冲直到那里。”那人道：“既然这样，就相烦二位。我是高太尉府里的心腹人陆虞候。”董超、薛霸连声应诺，说道：“小人是什么样的人，怎么敢跟您同席。”陆谦道：“你二位也知道林冲和太尉是对头。如今奉太尉的钧旨，叫把这十两金子送给二位，望你两个答应，不必走远，就在前面僻静的地方把林冲结果了(62)，就地讨一纸回状回来就是了(63)。要是开封府有什么话说，太尉自会吩咐，并不妨事。”董超道：“只怕使不得(64)。开封府的公文只叫押活的去(65)，却不曾叫结果了他。况且他年纪又不大，怎么好做这种事？倘若有什么纠缠(66)，恐怕不方便。”薛霸道：“董超，你听我说。高太尉就是叫你我去死，也只能依他。别说这位官人又送金子给俺。你不要多说，跟你分了罢，落得做人情，日后也有个照应俺的地方。前头有的是大松林凶险的去处，不管怎样，跟他结果了罢。”",
63: "时值六月天气，酷暑正热。林冲刚挨完棒杖时(69)，倒也没事。此后两三天，天气大热，棒疮却发作了(70)。又是个新挨棒的人，路上一步挨一步(71)，走不动。董超道：“你真不懂事(72)！这里离沧州还有二千多里路，你这样走，什么时候能到(73)！”林冲道：“小人在太尉府里受了些伤(74)，前天才挨了棒，棒疮发作。这样炎热，上下只好担待一步(75)。”薛霸道：“你自慢慢走，别听他唠叨(76)。”董超一路上唠唠叨叨(77)，口里埋怨叫苦，说道：“真是老爷们晦气，撞上你这个魔头。”看看天色又晚，只见：",
67: "当晚三个人投村中客店里来。到了房里，两个公人放下棍棒，解下包裹。林冲也把包解了，不等公人开口，去包里取些碎银两，托店小二买些酒肉，买些米来(80)，安排下酒菜，请两个防送公人坐下吃。董超、薛霸又添酒来，把林冲灌醉了，连枷倒在一边。薛霸去烧了一锅滚开的水(81)，提来倒在脚盆里，叫道：“林教头，你也洗了脚好睡。”林冲挣扎着起来，被枷碍着，弯不下身(82)。薛霸便道：“我替你洗。”林冲忙道：“使不得！”薛霸道：“出门在外的人，哪里计较得那么多。”",
83: "薛霸从腰里解下绳子来，把林冲连手带脚和枷紧紧绑在树上。两个跳起来，转过身来，拿起水火棍，看着林冲，说道：“不是俺要结果你。只因前几天来时，有那陆虞候传高太尉的钧旨，叫我两个到这里结果你，立等金印回去回话。就算多走几天，也是死。今天就在这里，倒成全我两个早些回去。不要怨我们弟兄两个，只是上司差遣，由不得自己。你也要明白些(96)，明年今日就是你的周年(97)。我们已经限定了日期，也要早些回去回话。”",
})

gen.run('ch008', base)
